WARNING:tensorflow:From /usr/local/lib/python3.6/dist-packages/tensorflow_core/python/ops/resource_variable_ops.py:1630: calling BaseResourceVariable.__init__ (from tensorflow.python.ops.resource_variable_ops) with constraint is deprecated and will be removed in a future version.
Instructions for updating:
If using Keras pass *_constraint arguments to layers.
WARNING:tensorflow:From /usr/local/lib/python3.6/dist-packages/tensorflow_core/python/ops/nn_impl.py:183: where (from tensorflow.python.ops.array_ops) is deprecated and will be removed in a future version.
Instructions for updating:
Use tf.where in 2.0, which has the same broadcast rule as np.where
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
img (InputLayer)                [(None, 384, 1280, 1 0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 384, 1280, 12 120         img[0][0]                        
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 384, 1280, 12 48          conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 384, 1280, 12 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 192, 640, 12) 0           activation_1[0][0]               
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 192, 640, 24) 2616        max_pooling2d[0][0]              
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 192, 640, 24) 96          conv2d_3[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 192, 640, 24) 0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 96, 320, 24)  0           activation_3[0][0]               
__________________________________________________________________________________________________
dropout (Dropout)               (None, 96, 320, 24)  0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 96, 320, 48)  10416       dropout[0][0]                    
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 96, 320, 48)  192         conv2d_5[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 96, 320, 48)  0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 48, 160, 48)  0           activation_5[0][0]               
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 48, 160, 48)  0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 48, 160, 96)  41568       dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 48, 160, 96)  384         conv2d_7[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 48, 160, 96)  0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 24, 80, 96)   0           activation_7[0][0]               
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 24, 80, 192)  166080      max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 24, 80, 192)  768         conv2d_9[0][0]                   
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 24, 80, 192)  0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 48, 160, 96)  165984      activation_9[0][0]               
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 48, 160, 192) 0           conv2d_transpose[0][0]           
                                                                 activation_7[0][0]               
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 48, 160, 192) 0           concatenate[0][0]                
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 48, 160, 96)  165984      dropout_2[0][0]                  
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 48, 160, 96)  384         conv2d_11[0][0]                  
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 48, 160, 96)  0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 96, 320, 48)  41520       activation_11[0][0]              
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 96, 320, 96)  0           conv2d_transpose_1[0][0]         
                                                                 activation_5[0][0]               
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 96, 320, 48)  41520       concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 96, 320, 48)  192         conv2d_13[0][0]                  
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 96, 320, 48)  0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 192, 640, 24) 10392       activation_13[0][0]              
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 192, 640, 48) 0           conv2d_transpose_2[0][0]         
                                                                 activation_3[0][0]               
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 192, 640, 48) 0           concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 192, 640, 24) 10392       dropout_3[0][0]                  
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 192, 640, 24) 96          conv2d_15[0][0]                  
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 192, 640, 24) 0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 384, 1280, 12 2604        activation_15[0][0]              
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 384, 1280, 24 0           conv2d_transpose_3[0][0]         
                                                                 activation_1[0][0]               
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 384, 1280, 12 2604        concatenate_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 384, 1280, 12 48          conv2d_17[0][0]                  
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 384, 1280, 12 0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 384, 1280, 1) 13          activation_17[0][0]              
==================================================================================================
Total params: 664,021
Trainable params: 662,917
Non-trainable params: 1,104
__________________________________________________________________________________________________
Train on 334 samples, validate on 60 samples
Epoch 1/100
320/334 [===========================>..] - ETA: 8s - loss: 0.5931 - acc: 0.8000 
Epoch 00001: val_loss improved from inf to 1.33083, saving model to model-tgs-salt.h5
334/334 [==============================] - 217s 648ms/sample - loss: 0.5906 - acc: 0.8038 - val_loss: 1.3308 - val_acc: 0.5655
Epoch 2/100
320/334 [===========================>..] - ETA: 8s - loss: 0.4857 - acc: 0.9200 
Epoch 00002: val_loss improved from 1.33083 to 0.94254, saving model to model-tgs-salt.h5
334/334 [==============================] - 211s 631ms/sample - loss: 0.4846 - acc: 0.9207 - val_loss: 0.9425 - val_acc: 0.2993
Epoch 3/100
320/334 [===========================>..] - ETA: 8s - loss: 0.4343 - acc: 0.9320 
Epoch 00003: val_loss improved from 0.94254 to 0.75762, saving model to model-tgs-salt.h5
334/334 [==============================] - 209s 626ms/sample - loss: 0.4335 - acc: 0.9323 - val_loss: 0.7576 - val_acc: 0.3890
Epoch 4/100
320/334 [===========================>..] - ETA: 8s - loss: 0.3962 - acc: 0.9289 
Epoch 00004: val_loss improved from 0.75762 to 0.55887, saving model to model-tgs-salt.h5
334/334 [==============================] - 209s 626ms/sample - loss: 0.3955 - acc: 0.9291 - val_loss: 0.5589 - val_acc: 0.7147
Epoch 5/100
320/334 [===========================>..] - ETA: 8s - loss: 0.3706 - acc: 0.9366 
Epoch 00005: val_loss improved from 0.55887 to 0.53499, saving model to model-tgs-salt.h5
334/334 [==============================] - 211s 631ms/sample - loss: 0.3696 - acc: 0.9378 - val_loss: 0.5350 - val_acc: 0.7892
Epoch 6/100
320/334 [===========================>..] - ETA: 8s - loss: 0.3493 - acc: 0.9425 
Epoch 00006: val_loss improved from 0.53499 to 0.49176, saving model to model-tgs-salt.h5
334/334 [==============================] - 209s 626ms/sample - loss: 0.3484 - acc: 0.9436 - val_loss: 0.4918 - val_acc: 0.7910
Epoch 7/100
320/334 [===========================>..] - ETA: 8s - loss: 0.3348 - acc: 0.9445 
Epoch 00007: val_loss did not improve from 0.49176
334/334 [==============================] - 209s 626ms/sample - loss: 0.3344 - acc: 0.9445 - val_loss: 0.4927 - val_acc: 0.9241
Epoch 8/100
320/334 [===========================>..] - ETA: 8s - loss: 0.3197 - acc: 0.9450 
Epoch 00008: val_loss improved from 0.49176 to 0.48185, saving model to model-tgs-salt.h5
334/334 [==============================] - 209s 624ms/sample - loss: 0.3198 - acc: 0.9448 - val_loss: 0.4819 - val_acc: 0.9323
Epoch 9/100
320/334 [===========================>..] - ETA: 8s - loss: 0.3052 - acc: 0.9453 
Epoch 00009: val_loss improved from 0.48185 to 0.47246, saving model to model-tgs-salt.h5
334/334 [==============================] - 207s 621ms/sample - loss: 0.3049 - acc: 0.9449 - val_loss: 0.4725 - val_acc: 0.9325
Epoch 10/100
320/334 [===========================>..] - ETA: 8s - loss: 0.2891 - acc: 0.9444 
Epoch 00010: val_loss improved from 0.47246 to 0.42635, saving model to model-tgs-salt.h5
334/334 [==============================] - 209s 624ms/sample - loss: 0.2881 - acc: 0.9451 - val_loss: 0.4264 - val_acc: 0.8617
Epoch 11/100
320/334 [===========================>..] - ETA: 8s - loss: 0.2742 - acc: 0.9467 
Epoch 00011: val_loss improved from 0.42635 to 0.41033, saving model to model-tgs-salt.h5
334/334 [==============================] - 211s 633ms/sample - loss: 0.2739 - acc: 0.9466 - val_loss: 0.4103 - val_acc: 0.8517
Epoch 12/100
320/334 [===========================>..] - ETA: 8s - loss: 0.2615 - acc: 0.9478 
Epoch 00012: val_loss improved from 0.41033 to 0.33017, saving model to model-tgs-salt.h5
334/334 [==============================] - 209s 625ms/sample - loss: 0.2603 - acc: 0.9490 - val_loss: 0.3302 - val_acc: 0.9364
Epoch 13/100
320/334 [===========================>..] - ETA: 8s - loss: 0.2492 - acc: 0.9496 
Epoch 00013: val_loss did not improve from 0.33017
334/334 [==============================] - 208s 622ms/sample - loss: 0.2484 - acc: 0.9499 - val_loss: 0.4096 - val_acc: 0.8169
Epoch 14/100
320/334 [===========================>..] - ETA: 8s - loss: 0.2365 - acc: 0.9500 
Epoch 00014: val_loss did not improve from 0.33017
334/334 [==============================] - 208s 622ms/sample - loss: 0.2367 - acc: 0.9497 - val_loss: 0.4090 - val_acc: 0.8085
Epoch 15/100
320/334 [===========================>..] - ETA: 8s - loss: 0.2289 - acc: 0.9490 
Epoch 00015: ReduceLROnPlateau reducing learning rate to 0.00010000000474974513.

Epoch 00015: val_loss did not improve from 0.33017
334/334 [==============================] - 208s 622ms/sample - loss: 0.2286 - acc: 0.9491 - val_loss: 0.3708 - val_acc: 0.9021
Epoch 16/100
320/334 [===========================>..] - ETA: 8s - loss: 0.2234 - acc: 0.9525 
Epoch 00016: val_loss did not improve from 0.33017
334/334 [==============================] - 209s 627ms/sample - loss: 0.2239 - acc: 0.9519 - val_loss: 0.3562 - val_acc: 0.9012
Epoch 17/100
320/334 [===========================>..] - ETA: 8s - loss: 0.2194 - acc: 0.9535 
Epoch 00017: val_loss improved from 0.33017 to 0.32781, saving model to model-tgs-salt.h5
334/334 [==============================] - 210s 628ms/sample - loss: 0.2194 - acc: 0.9535 - val_loss: 0.3278 - val_acc: 0.9139
Epoch 18/100
320/334 [===========================>..] - ETA: 8s - loss: 0.2193 - acc: 0.9513 
Epoch 00018: val_loss improved from 0.32781 to 0.29570, saving model to model-tgs-salt.h5
334/334 [==============================] - 210s 629ms/sample - loss: 0.2186 - acc: 0.9520 - val_loss: 0.2957 - val_acc: 0.9273
Epoch 19/100
320/334 [===========================>..] - ETA: 8s - loss: 0.2175 - acc: 0.9521 
Epoch 00019: val_loss improved from 0.29570 to 0.28157, saving model to model-tgs-salt.h5
334/334 [==============================] - 210s 630ms/sample - loss: 0.2172 - acc: 0.9526 - val_loss: 0.2816 - val_acc: 0.9292
Epoch 20/100
320/334 [===========================>..] - ETA: 8s - loss: 0.2163 - acc: 0.9525 
Epoch 00020: val_loss improved from 0.28157 to 0.26158, saving model to model-tgs-salt.h5
334/334 [==============================] - 209s 625ms/sample - loss: 0.2162 - acc: 0.9525 - val_loss: 0.2616 - val_acc: 0.9318
Epoch 21/100
320/334 [===========================>..] - ETA: 8s - loss: 0.2141 - acc: 0.9542 
Epoch 00021: val_loss improved from 0.26158 to 0.25082, saving model to model-tgs-salt.h5
334/334 [==============================] - 209s 626ms/sample - loss: 0.2148 - acc: 0.9535 - val_loss: 0.2508 - val_acc: 0.9327
Epoch 22/100
320/334 [===========================>..] - ETA: 8s - loss: 0.2140 - acc: 0.9540 
Epoch 00022: val_loss improved from 0.25082 to 0.24210, saving model to model-tgs-salt.h5
334/334 [==============================] - 209s 626ms/sample - loss: 0.2137 - acc: 0.9540 - val_loss: 0.2421 - val_acc: 0.9331
Epoch 23/100
320/334 [===========================>..] - ETA: 8s - loss: 0.2130 - acc: 0.9526 
Epoch 00023: val_loss improved from 0.24210 to 0.23776, saving model to model-tgs-salt.h5
334/334 [==============================] - 210s 630ms/sample - loss: 0.2122 - acc: 0.9533 - val_loss: 0.2378 - val_acc: 0.9335
Epoch 24/100
320/334 [===========================>..] - ETA: 8s - loss: 0.2121 - acc: 0.9536 
Epoch 00024: val_loss improved from 0.23776 to 0.23334, saving model to model-tgs-salt.h5
334/334 [==============================] - 212s 635ms/sample - loss: 0.2117 - acc: 0.9536 - val_loss: 0.2333 - val_acc: 0.9342
Epoch 25/100
320/334 [===========================>..] - ETA: 8s - loss: 0.2108 - acc: 0.9536 
Epoch 00025: val_loss improved from 0.23334 to 0.22873, saving model to model-tgs-salt.h5
334/334 [==============================] - 209s 627ms/sample - loss: 0.2107 - acc: 0.9536 - val_loss: 0.2287 - val_acc: 0.9344
Epoch 26/100
320/334 [===========================>..] - ETA: 8s - loss: 0.2085 - acc: 0.9548 
Epoch 00026: val_loss improved from 0.22873 to 0.22580, saving model to model-tgs-salt.h5
334/334 [==============================] - 209s 627ms/sample - loss: 0.2086 - acc: 0.9546 - val_loss: 0.2258 - val_acc: 0.9344
Epoch 27/100
320/334 [===========================>..] - ETA: 8s - loss: 0.2079 - acc: 0.9545 
Epoch 00027: val_loss improved from 0.22580 to 0.22344, saving model to model-tgs-salt.h5
334/334 [==============================] - 209s 625ms/sample - loss: 0.2083 - acc: 0.9542 - val_loss: 0.2234 - val_acc: 0.9343
Epoch 28/100
320/334 [===========================>..] - ETA: 8s - loss: 0.2067 - acc: 0.9551 
Epoch 00028: val_loss improved from 0.22344 to 0.22202, saving model to model-tgs-salt.h5
334/334 [==============================] - 211s 633ms/sample - loss: 0.2066 - acc: 0.9552 - val_loss: 0.2220 - val_acc: 0.9343
Epoch 29/100
320/334 [===========================>..] - ETA: 8s - loss: 0.2057 - acc: 0.9550 
Epoch 00029: val_loss improved from 0.22202 to 0.22034, saving model to model-tgs-salt.h5
334/334 [==============================] - 221s 662ms/sample - loss: 0.2056 - acc: 0.9553 - val_loss: 0.2203 - val_acc: 0.9344
Epoch 30/100
320/334 [===========================>..] - ETA: 9s - loss: 0.2057 - acc: 0.9549 
Epoch 00030: val_loss improved from 0.22034 to 0.21931, saving model to model-tgs-salt.h5
334/334 [==============================] - 222s 664ms/sample - loss: 0.2051 - acc: 0.9554 - val_loss: 0.2193 - val_acc: 0.9345
Epoch 31/100
320/334 [===========================>..] - ETA: 8s - loss: 0.2055 - acc: 0.9520 
Epoch 00031: val_loss did not improve from 0.21931
334/334 [==============================] - 220s 657ms/sample - loss: 0.2055 - acc: 0.9520 - val_loss: 0.2204 - val_acc: 0.9345
Epoch 32/100
320/334 [===========================>..] - ETA: 8s - loss: 0.2035 - acc: 0.9545 
Epoch 00032: val_loss improved from 0.21931 to 0.21722, saving model to model-tgs-salt.h5
334/334 [==============================] - 220s 660ms/sample - loss: 0.2035 - acc: 0.9544 - val_loss: 0.2172 - val_acc: 0.9352
Epoch 33/100
320/334 [===========================>..] - ETA: 8s - loss: 0.2026 - acc: 0.9544 
Epoch 00033: val_loss did not improve from 0.21722
334/334 [==============================] - 221s 661ms/sample - loss: 0.2026 - acc: 0.9543 - val_loss: 0.2198 - val_acc: 0.9354
Epoch 34/100
320/334 [===========================>..] - ETA: 8s - loss: 0.2018 - acc: 0.9546 
Epoch 00034: val_loss did not improve from 0.21722
334/334 [==============================] - 212s 635ms/sample - loss: 0.2010 - acc: 0.9550 - val_loss: 0.2184 - val_acc: 0.9354
Epoch 35/100
320/334 [===========================>..] - ETA: 8s - loss: 0.2005 - acc: 0.9554 
Epoch 00035: ReduceLROnPlateau reducing learning rate to 1.0000000474974514e-05.

Epoch 00035: val_loss did not improve from 0.21722
334/334 [==============================] - 212s 635ms/sample - loss: 0.1999 - acc: 0.9557 - val_loss: 0.2189 - val_acc: 0.9354
Epoch 36/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1996 - acc: 0.9558 
Epoch 00036: val_loss did not improve from 0.21722
334/334 [==============================] - 211s 631ms/sample - loss: 0.1993 - acc: 0.9560 - val_loss: 0.2184 - val_acc: 0.9355
Epoch 37/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1985 - acc: 0.9562 
Epoch 00037: val_loss did not improve from 0.21722
334/334 [==============================] - 208s 623ms/sample - loss: 0.1983 - acc: 0.9563 - val_loss: 0.2178 - val_acc: 0.9357
Epoch 38/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1990 - acc: 0.9556 
Epoch 00038: ReduceLROnPlateau reducing learning rate to 1e-05.

Epoch 00038: val_loss improved from 0.21722 to 0.21712, saving model to model-tgs-salt.h5
334/334 [==============================] - 210s 628ms/sample - loss: 0.1993 - acc: 0.9552 - val_loss: 0.2171 - val_acc: 0.9360
Epoch 39/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1996 - acc: 0.9551 
Epoch 00039: val_loss improved from 0.21712 to 0.21657, saving model to model-tgs-salt.h5
334/334 [==============================] - 209s 625ms/sample - loss: 0.1992 - acc: 0.9552 - val_loss: 0.2166 - val_acc: 0.9361
Epoch 40/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1987 - acc: 0.9556 
Epoch 00040: val_loss improved from 0.21657 to 0.21567, saving model to model-tgs-salt.h5
334/334 [==============================] - 205s 612ms/sample - loss: 0.1988 - acc: 0.9558 - val_loss: 0.2157 - val_acc: 0.9364
Epoch 41/100
320/334 [===========================>..] - ETA: 8s - loss: 0.2008 - acc: 0.9540 
Epoch 00041: val_loss improved from 0.21567 to 0.21540, saving model to model-tgs-salt.h5
334/334 [==============================] - 200s 599ms/sample - loss: 0.1999 - acc: 0.9547 - val_loss: 0.2154 - val_acc: 0.9364
Epoch 42/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1991 - acc: 0.9551 
Epoch 00042: val_loss improved from 0.21540 to 0.21513, saving model to model-tgs-salt.h5
334/334 [==============================] - 207s 620ms/sample - loss: 0.1992 - acc: 0.9552 - val_loss: 0.2151 - val_acc: 0.9365
Epoch 43/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1984 - acc: 0.9557 
Epoch 00043: val_loss improved from 0.21513 to 0.21485, saving model to model-tgs-salt.h5
334/334 [==============================] - 212s 635ms/sample - loss: 0.1990 - acc: 0.9552 - val_loss: 0.2148 - val_acc: 0.9366
Epoch 44/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1987 - acc: 0.9559 
Epoch 00044: val_loss improved from 0.21485 to 0.21475, saving model to model-tgs-salt.h5
334/334 [==============================] - 213s 638ms/sample - loss: 0.1984 - acc: 0.9560 - val_loss: 0.2147 - val_acc: 0.9366
Epoch 45/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1987 - acc: 0.9560 
Epoch 00045: val_loss improved from 0.21475 to 0.21417, saving model to model-tgs-salt.h5
334/334 [==============================] - 217s 650ms/sample - loss: 0.1987 - acc: 0.9558 - val_loss: 0.2142 - val_acc: 0.9368
Epoch 46/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1982 - acc: 0.9559 
Epoch 00046: val_loss improved from 0.21417 to 0.21375, saving model to model-tgs-salt.h5
334/334 [==============================] - 214s 640ms/sample - loss: 0.1982 - acc: 0.9559 - val_loss: 0.2137 - val_acc: 0.9367
Epoch 47/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1984 - acc: 0.9564 
Epoch 00047: val_loss improved from 0.21375 to 0.21358, saving model to model-tgs-salt.h5
334/334 [==============================] - 211s 631ms/sample - loss: 0.1976 - acc: 0.9567 - val_loss: 0.2136 - val_acc: 0.9367
Epoch 48/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1980 - acc: 0.9556 
Epoch 00048: val_loss improved from 0.21358 to 0.21321, saving model to model-tgs-salt.h5
334/334 [==============================] - 211s 633ms/sample - loss: 0.1980 - acc: 0.9556 - val_loss: 0.2132 - val_acc: 0.9369
Epoch 49/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1982 - acc: 0.9561 
Epoch 00049: val_loss improved from 0.21321 to 0.21296, saving model to model-tgs-salt.h5
334/334 [==============================] - 210s 627ms/sample - loss: 0.1983 - acc: 0.9561 - val_loss: 0.2130 - val_acc: 0.9368
Epoch 50/100
320/334 [===========================>..] - ETA: 7s - loss: 0.1975 - acc: 0.9559 
Epoch 00050: val_loss improved from 0.21296 to 0.21263, saving model to model-tgs-salt.h5
334/334 [==============================] - 195s 584ms/sample - loss: 0.1983 - acc: 0.9552 - val_loss: 0.2126 - val_acc: 0.9370
Epoch 51/100
320/334 [===========================>..] - ETA: 7s - loss: 0.1985 - acc: 0.9553 
Epoch 00051: val_loss did not improve from 0.21263
334/334 [==============================] - 194s 580ms/sample - loss: 0.1978 - acc: 0.9557 - val_loss: 0.2127 - val_acc: 0.9369
Epoch 52/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1971 - acc: 0.9569 
Epoch 00052: val_loss improved from 0.21263 to 0.21251, saving model to model-tgs-salt.h5
334/334 [==============================] - 197s 590ms/sample - loss: 0.1971 - acc: 0.9567 - val_loss: 0.2125 - val_acc: 0.9369
Epoch 53/100
320/334 [===========================>..] - ETA: 7s - loss: 0.1979 - acc: 0.9557 
Epoch 00053: val_loss improved from 0.21251 to 0.21240, saving model to model-tgs-salt.h5
334/334 [==============================] - 196s 586ms/sample - loss: 0.1974 - acc: 0.9561 - val_loss: 0.2124 - val_acc: 0.9370
Epoch 54/100
320/334 [===========================>..] - ETA: 7s - loss: 0.1986 - acc: 0.9552 
Epoch 00054: val_loss improved from 0.21240 to 0.21214, saving model to model-tgs-salt.h5
334/334 [==============================] - 195s 585ms/sample - loss: 0.1980 - acc: 0.9555 - val_loss: 0.2121 - val_acc: 0.9372
Epoch 55/100
320/334 [===========================>..] - ETA: 7s - loss: 0.1978 - acc: 0.9559 
Epoch 00055: val_loss improved from 0.21214 to 0.21189, saving model to model-tgs-salt.h5
334/334 [==============================] - 193s 577ms/sample - loss: 0.1971 - acc: 0.9565 - val_loss: 0.2119 - val_acc: 0.9372
Epoch 56/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1974 - acc: 0.9558 
Epoch 00056: val_loss improved from 0.21189 to 0.21189, saving model to model-tgs-salt.h5
334/334 [==============================] - 199s 594ms/sample - loss: 0.1977 - acc: 0.9555 - val_loss: 0.2119 - val_acc: 0.9371
Epoch 57/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1979 - acc: 0.9550 
Epoch 00057: val_loss did not improve from 0.21189
334/334 [==============================] - 205s 615ms/sample - loss: 0.1975 - acc: 0.9554 - val_loss: 0.2120 - val_acc: 0.9370
Epoch 58/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1963 - acc: 0.9567 
Epoch 00058: val_loss improved from 0.21189 to 0.21175, saving model to model-tgs-salt.h5
334/334 [==============================] - 206s 618ms/sample - loss: 0.1972 - acc: 0.9559 - val_loss: 0.2117 - val_acc: 0.9371
Epoch 59/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1975 - acc: 0.9560 
Epoch 00059: val_loss improved from 0.21175 to 0.21164, saving model to model-tgs-salt.h5
334/334 [==============================] - 207s 620ms/sample - loss: 0.1977 - acc: 0.9555 - val_loss: 0.2116 - val_acc: 0.9371
Epoch 60/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1980 - acc: 0.9548 
Epoch 00060: val_loss improved from 0.21164 to 0.21157, saving model to model-tgs-salt.h5
334/334 [==============================] - 208s 622ms/sample - loss: 0.1975 - acc: 0.9553 - val_loss: 0.2116 - val_acc: 0.9370
Epoch 61/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1972 - acc: 0.9554 
Epoch 00061: val_loss improved from 0.21157 to 0.21144, saving model to model-tgs-salt.h5
334/334 [==============================] - 209s 625ms/sample - loss: 0.1968 - acc: 0.9557 - val_loss: 0.2114 - val_acc: 0.9371
Epoch 62/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1971 - acc: 0.9561 
Epoch 00062: val_loss improved from 0.21144 to 0.21120, saving model to model-tgs-salt.h5
334/334 [==============================] - 210s 628ms/sample - loss: 0.1965 - acc: 0.9562 - val_loss: 0.2112 - val_acc: 0.9372
Epoch 63/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1967 - acc: 0.9560 
Epoch 00063: val_loss improved from 0.21120 to 0.21095, saving model to model-tgs-salt.h5
334/334 [==============================] - 209s 626ms/sample - loss: 0.1970 - acc: 0.9555 - val_loss: 0.2109 - val_acc: 0.9372
Epoch 64/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1961 - acc: 0.9563 
Epoch 00064: val_loss improved from 0.21095 to 0.21083, saving model to model-tgs-salt.h5
334/334 [==============================] - 209s 627ms/sample - loss: 0.1960 - acc: 0.9564 - val_loss: 0.2108 - val_acc: 0.9372
Epoch 65/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1972 - acc: 0.9558 
Epoch 00065: val_loss improved from 0.21083 to 0.21082, saving model to model-tgs-salt.h5
334/334 [==============================] - 209s 625ms/sample - loss: 0.1971 - acc: 0.9556 - val_loss: 0.2108 - val_acc: 0.9371
Epoch 66/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1968 - acc: 0.9558 
Epoch 00066: val_loss improved from 0.21082 to 0.21065, saving model to model-tgs-salt.h5
334/334 [==============================] - 209s 626ms/sample - loss: 0.1963 - acc: 0.9563 - val_loss: 0.2107 - val_acc: 0.9373
Epoch 67/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1970 - acc: 0.9554 
Epoch 00067: val_loss improved from 0.21065 to 0.21062, saving model to model-tgs-salt.h5
334/334 [==============================] - 210s 628ms/sample - loss: 0.1968 - acc: 0.9555 - val_loss: 0.2106 - val_acc: 0.9372
Epoch 68/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1962 - acc: 0.9567 
Epoch 00068: val_loss improved from 0.21062 to 0.21049, saving model to model-tgs-salt.h5
334/334 [==============================] - 209s 626ms/sample - loss: 0.1962 - acc: 0.9567 - val_loss: 0.2105 - val_acc: 0.9373
Epoch 69/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1972 - acc: 0.9550 
Epoch 00069: val_loss improved from 0.21049 to 0.21042, saving model to model-tgs-salt.h5
334/334 [==============================] - 207s 620ms/sample - loss: 0.1969 - acc: 0.9553 - val_loss: 0.2104 - val_acc: 0.9373
Epoch 70/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1966 - acc: 0.9560 
Epoch 00070: val_loss improved from 0.21042 to 0.21032, saving model to model-tgs-salt.h5
334/334 [==============================] - 205s 615ms/sample - loss: 0.1961 - acc: 0.9562 - val_loss: 0.2103 - val_acc: 0.9373
Epoch 71/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1952 - acc: 0.9565 
Epoch 00071: val_loss improved from 0.21032 to 0.21023, saving model to model-tgs-salt.h5
334/334 [==============================] - 204s 611ms/sample - loss: 0.1955 - acc: 0.9560 - val_loss: 0.2102 - val_acc: 0.9373
Epoch 72/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1942 - acc: 0.9574 
Epoch 00072: val_loss improved from 0.21023 to 0.20993, saving model to model-tgs-salt.h5
334/334 [==============================] - 205s 614ms/sample - loss: 0.1959 - acc: 0.9563 - val_loss: 0.2099 - val_acc: 0.9374
Epoch 73/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1957 - acc: 0.9562 
Epoch 00073: val_loss did not improve from 0.20993
334/334 [==============================] - 209s 625ms/sample - loss: 0.1958 - acc: 0.9561 - val_loss: 0.2099 - val_acc: 0.9373
Epoch 74/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1954 - acc: 0.9560 
Epoch 00074: val_loss improved from 0.20993 to 0.20973, saving model to model-tgs-salt.h5
334/334 [==============================] - 210s 630ms/sample - loss: 0.1956 - acc: 0.9558 - val_loss: 0.2097 - val_acc: 0.9375
Epoch 75/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1956 - acc: 0.9565 
Epoch 00075: val_loss did not improve from 0.20973
334/334 [==============================] - 210s 630ms/sample - loss: 0.1955 - acc: 0.9564 - val_loss: 0.2098 - val_acc: 0.9374
Epoch 76/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1955 - acc: 0.9560 
Epoch 00076: val_loss improved from 0.20973 to 0.20962, saving model to model-tgs-salt.h5
334/334 [==============================] - 213s 638ms/sample - loss: 0.1955 - acc: 0.9559 - val_loss: 0.2096 - val_acc: 0.9373
Epoch 77/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1965 - acc: 0.9554 
Epoch 00077: val_loss improved from 0.20962 to 0.20927, saving model to model-tgs-salt.h5
334/334 [==============================] - 215s 643ms/sample - loss: 0.1959 - acc: 0.9559 - val_loss: 0.2093 - val_acc: 0.9374
Epoch 78/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1956 - acc: 0.9566 
Epoch 00078: val_loss improved from 0.20927 to 0.20904, saving model to model-tgs-salt.h5
334/334 [==============================] - 214s 641ms/sample - loss: 0.1951 - acc: 0.9569 - val_loss: 0.2090 - val_acc: 0.9375
Epoch 79/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1963 - acc: 0.9553 
Epoch 00079: val_loss improved from 0.20904 to 0.20882, saving model to model-tgs-salt.h5
334/334 [==============================] - 214s 641ms/sample - loss: 0.1963 - acc: 0.9552 - val_loss: 0.2088 - val_acc: 0.9375
Epoch 80/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1949 - acc: 0.9568 
Epoch 00080: val_loss improved from 0.20882 to 0.20878, saving model to model-tgs-salt.h5
334/334 [==============================] - 213s 637ms/sample - loss: 0.1947 - acc: 0.9567 - val_loss: 0.2088 - val_acc: 0.9374
Epoch 81/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1953 - acc: 0.9565 
Epoch 00081: val_loss improved from 0.20878 to 0.20867, saving model to model-tgs-salt.h5
334/334 [==============================] - 214s 640ms/sample - loss: 0.1949 - acc: 0.9566 - val_loss: 0.2087 - val_acc: 0.9375
Epoch 82/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1951 - acc: 0.9557 
Epoch 00082: val_loss improved from 0.20867 to 0.20860, saving model to model-tgs-salt.h5
334/334 [==============================] - 217s 649ms/sample - loss: 0.1951 - acc: 0.9556 - val_loss: 0.2086 - val_acc: 0.9375
Epoch 83/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1961 - acc: 0.9555 
Epoch 00083: val_loss improved from 0.20860 to 0.20855, saving model to model-tgs-salt.h5
334/334 [==============================] - 219s 656ms/sample - loss: 0.1952 - acc: 0.9562 - val_loss: 0.2086 - val_acc: 0.9375
Epoch 84/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1949 - acc: 0.9561 
Epoch 00084: val_loss did not improve from 0.20855
334/334 [==============================] - 215s 643ms/sample - loss: 0.1948 - acc: 0.9561 - val_loss: 0.2086 - val_acc: 0.9374
Epoch 85/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1941 - acc: 0.9568 
Epoch 00085: val_loss did not improve from 0.20855
334/334 [==============================] - 210s 628ms/sample - loss: 0.1942 - acc: 0.9566 - val_loss: 0.2086 - val_acc: 0.9374
Epoch 86/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1950 - acc: 0.9559 
Epoch 00086: val_loss did not improve from 0.20855
334/334 [==============================] - 212s 634ms/sample - loss: 0.1946 - acc: 0.9561 - val_loss: 0.2086 - val_acc: 0.9375
Epoch 87/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1944 - acc: 0.9564 
Epoch 00087: val_loss did not improve from 0.20855
334/334 [==============================] - 216s 647ms/sample - loss: 0.1945 - acc: 0.9563 - val_loss: 0.2086 - val_acc: 0.9374
Epoch 88/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1963 - acc: 0.9544 
Epoch 00088: val_loss did not improve from 0.20855
334/334 [==============================] - 211s 630ms/sample - loss: 0.1957 - acc: 0.9549 - val_loss: 0.2086 - val_acc: 0.9374
Epoch 89/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1932 - acc: 0.9570 
Epoch 00089: val_loss did not improve from 0.20855
334/334 [==============================] - 213s 637ms/sample - loss: 0.1939 - acc: 0.9565 - val_loss: 0.2087 - val_acc: 0.9373
Epoch 90/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1939 - acc: 0.9566 
Epoch 00090: val_loss did not improve from 0.20855
334/334 [==============================] - 214s 640ms/sample - loss: 0.1945 - acc: 0.9560 - val_loss: 0.2087 - val_acc: 0.9373
Epoch 91/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1955 - acc: 0.9556 
Epoch 00091: val_loss improved from 0.20855 to 0.20851, saving model to model-tgs-salt.h5
334/334 [==============================] - 207s 621ms/sample - loss: 0.1948 - acc: 0.9558 - val_loss: 0.2085 - val_acc: 0.9374
Epoch 92/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1936 - acc: 0.9571 
Epoch 00092: val_loss improved from 0.20851 to 0.20827, saving model to model-tgs-salt.h5
334/334 [==============================] - 205s 615ms/sample - loss: 0.1937 - acc: 0.9570 - val_loss: 0.2083 - val_acc: 0.9376
Epoch 93/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1934 - acc: 0.9571 
Epoch 00093: val_loss improved from 0.20827 to 0.20809, saving model to model-tgs-salt.h5
334/334 [==============================] - 211s 631ms/sample - loss: 0.1937 - acc: 0.9568 - val_loss: 0.2081 - val_acc: 0.9376
Epoch 94/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1940 - acc: 0.9560 
Epoch 00094: val_loss improved from 0.20809 to 0.20797, saving model to model-tgs-salt.h5
334/334 [==============================] - 210s 627ms/sample - loss: 0.1935 - acc: 0.9564 - val_loss: 0.2080 - val_acc: 0.9376
Epoch 95/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1939 - acc: 0.9562 
Epoch 00095: val_loss improved from 0.20797 to 0.20793, saving model to model-tgs-salt.h5
334/334 [==============================] - 210s 630ms/sample - loss: 0.1942 - acc: 0.9560 - val_loss: 0.2079 - val_acc: 0.9375
Epoch 96/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1932 - acc: 0.9568 
Epoch 00096: val_loss improved from 0.20793 to 0.20775, saving model to model-tgs-salt.h5
334/334 [==============================] - 209s 627ms/sample - loss: 0.1934 - acc: 0.9565 - val_loss: 0.2077 - val_acc: 0.9378
Epoch 97/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1941 - acc: 0.9561 
Epoch 00097: val_loss did not improve from 0.20775
334/334 [==============================] - 209s 625ms/sample - loss: 0.1941 - acc: 0.9560 - val_loss: 0.2080 - val_acc: 0.9374
Epoch 98/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1939 - acc: 0.9558 
Epoch 00098: val_loss did not improve from 0.20775
334/334 [==============================] - 211s 631ms/sample - loss: 0.1938 - acc: 0.9557 - val_loss: 0.2079 - val_acc: 0.9374
Epoch 99/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1938 - acc: 0.9559 
Epoch 00099: val_loss did not improve from 0.20775
334/334 [==============================] - 212s 634ms/sample - loss: 0.1940 - acc: 0.9556 - val_loss: 0.2081 - val_acc: 0.9373
Epoch 100/100
320/334 [===========================>..] - ETA: 8s - loss: 0.1942 - acc: 0.9560 
Epoch 00100: val_loss did not improve from 0.20775
334/334 [==============================] - 209s 626ms/sample - loss: 0.1938 - acc: 0.9561 - val_loss: 0.2078 - val_acc: 0.9375